org/2014-07-18-postgres.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS:   H:2 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t

#+OPTIONS:   tex:t  d:nil todo:t pri:nil tags:not-in-toc
#+BEGIN_HTML
---
category: computer science and enginneering
layout: post
title: "Postgres Source Code and Theory"
description: "study database through postgres"
tags: ["database",tools]
---
{% include JB/setup %}

#+END_HTML

* Replacement Selection
ExecSort() extract all tuples 

#+BEGIN_SRC c
for (;;)
{
	slot = ExecProcNode(outerNode);

	if (TupIsNull(slot))
		break;

	tuplesort_puttupleslot(tuplesortstate, slot);
}
#+END_SRC

tuplesort_puttupleslot() -> ... -> puttuple_common(), at this time,
the state->status is TSS_INITIAL, when state->memtupcount is less than
state->memtupsize, where memtupsize is 8192 (equal to BLCKSZ).
#+BEGIN_SRC c
state->memtuples[state->memtupcount++] = *tuple;
#+END_SRC

when memtupcount is larger than 8192, inittapes() will be called and
use dumptuples() to insert state->memtuples[0] into relative temp
files (called run), and the new tuple from ExecProcNode(outerNode)
will insert state->memtuples.

* planner
select * from customer:
planner()<-pg_plan_query()<-pg_plan_queries()<-exec_simple_query()

explain select * from customer: planner()<-pg_plan_query()<-ExplainOneQuery()<-ExplainQuery()

* sql
** generate random number
#+BEGIN_SRC sql
tuplesort=# select random();
      random       
-------------------
 0.862202602438629
(1 row)
#+END_SRC

** create function for arbitrary date in a specified rang
#+BEGIN_SRC sql
tuplesort=# create or replace function generate_dates(
dt1 date,
dt2 date,
n int) returns setof date as 
$$
select $1 + $3;
$$ language 'sql' immutable;

tuplesort=# select generate_dates('2009-01-01','2009-12-31',mod((random()*10000)::integer,365));
 generate_dates 
----------------
 2009-11-13
(1 row)

tuplesort=# select generate_dates('2009-01-01','2009-12-31',mod((random()*10000)::integer,365));
 generate_dates 
----------------
 2009-09-28
(1 row)

#+END_SRC

