_posts/2014-07-18-postgres.html
---
category: computer science and enginneering
layout: post
title: "Postgres Source Code and Theory"
description: "study database through postgres"
tags: ["database",tools]
---
{% include JB/setup %}

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Replacement Selection</h2>
<div class="outline-text-2" id="text-1">
<p>
ExecSort() extract all tuples 
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">for</span> (;;)
{
        slot = ExecProcNode(outerNode);

        <span style="color: #b5bd68;">if</span> (TupIsNull(slot))
                <span style="color: #b5bd68;">break</span>;

        tuplesort_puttupleslot(tuplesortstate, slot);
}
</pre>
</div>

<p>
tuplesort_puttupleslot() -&gt; &#x2026; -&gt; puttuple_common(), at this time,
the state-&gt;status is TSS_INITIAL, when state-&gt;memtupcount is less than
state-&gt;memtupsize, where memtupsize is 8192 (equal to BLCKSZ).
</p>
<div class="org-src-container">

<pre class="src src-c">state-&gt;memtuples[state-&gt;memtupcount++] = *tuple;
</pre>
</div>

<p>
when memtupcount is larger than 8192, inittapes() will be called and
use dumptuples() to insert state-&gt;memtuples<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> into relative temp
files (called run), and the new tuple from ExecProcNode(outerNode)
will insert state-&gt;memtuples.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">planner</h2>
<div class="outline-text-2" id="text-2">
<p>
select * from customer:
planner()&lt;-pg_plan_query()&lt;-pg_plan_queries()&lt;-exec_simple_query()
</p>

<p>
explain select * from customer: planner()&lt;-pg_plan_query()&lt;-ExplainOneQuery()&lt;-ExplainQuery()
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">sql</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">generate random number</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sql">tuplesort=# <span style="color: #b5bd68;">select</span> random();
      random       
<span style="color: #969896; font-style: italic;">-------------------</span>
 0.862202602438629
(1 <span style="color: #81a2be;">row</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">create function for arbitrary date in a specified rang</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sql">tuplesort=# <span style="color: #b5bd68;">create</span> <span style="color: #b5bd68;">or</span> replace <span style="color: #b5bd68;">function</span> generate_dates(
dt1 <span style="color: #81a2be;">date</span>,
dt2 <span style="color: #81a2be;">date</span>,
n <span style="color: #81a2be;">int</span>) <span style="color: #b5bd68;">returns</span> setof <span style="color: #81a2be;">date</span> <span style="color: #b5bd68;">as</span> 
$$
<span style="color: #b5bd68;">select</span> $1 + $3;
$$ <span style="color: #b5bd68;">language</span> <span style="color: #8abeb7;">'sql'</span> immutable;

tuplesort=# <span style="color: #b5bd68;">select</span> generate_dates(<span style="color: #8abeb7;">'2009-01-01'</span>,<span style="color: #8abeb7;">'2009-12-31'</span>,<span style="color: #b294bb;">mod</span>((random()*10000)::<span style="color: #81a2be;">integer</span>,365));
 generate_dates 
<span style="color: #969896; font-style: italic;">----------------</span>
 2009-11-13
(1 <span style="color: #81a2be;">row</span>)

tuplesort=# <span style="color: #b5bd68;">select</span> generate_dates(<span style="color: #8abeb7;">'2009-01-01'</span>,<span style="color: #8abeb7;">'2009-12-31'</span>,<span style="color: #b294bb;">mod</span>((random()*10000)::<span style="color: #81a2be;">integer</span>,365));
 generate_dates 
<span style="color: #969896; font-style: italic;">----------------</span>
 2009-09-28
(1 <span style="color: #81a2be;">row</span>)
</pre>
</div>
</div>
</div>
</div>
