org/2014-07-18-postgres.org
* parser
the parser include two phases: parser and transfromation.

the parser phase mainly creates a specified called raw
parse tree,  which is a linked list of parse nodes. there are
several kinds of nodes, as defined in parsenodes.h, such as SelectStmt,
#+BEGIN_SRC c
typedef struct SelectStmt
{
	NodeTag		type;

	/*
	 * These fields are used only in "leaf" SelectStmts.
	 */
	List	   *distinctClause; /* NULL, list of DISTINCT ON exprs, or
								 * lcons(NIL,NIL) for all (SELECT DISTINCT) */
	IntoClause *intoClause;		/* target for SELECT INTO / CREATE TABLE AS */
	List	   *targetList;		/* the target list (of ResTarget) */
	List	   *fromClause;		/* the FROM clause */
	Node	   *whereClause;	/* WHERE qualification */
	List	   *groupClause;	/* GROUP BY clauses */
	Node	   *havingClause;	/* HAVING conditional-expression */
	List	   *windowClause;	/* WINDOW window_name AS (...), ... */
	WithClause *withClause;		/* WITH clause */
      ...
}
#+END_SRC
the first member of these classes of structures all is NodeTag, every
query will create a node with some fixed members, in above
SelectStmt, which has intClause, targetList, etc,. so in gram.y, for
every kind of query, it creates a root node for special query:
#+BEGIN_SRC c
simple_select:
			SELECT opt_distinct target_list
			into_clause from_clause where_clause
			group_clause having_clause window_clause
				{
					SelectStmt *n = makeNode(SelectStmt);
					n->distinctClause = $2;
					n->targetList = $3;
					n->intoClause = $4;
					n->fromClause = $5;
...
#+END_SRC 
and the definition for makeNode in nodes.h
#+BEGIN_SRC c
extern PGDLLIMPORT Node *newNodeMacroHolder;
#define newNode(size, tag) \
( \
	AssertMacro((size) >= sizeof(Node)),		/* need the tag, at least */ \
	newNodeMacroHolder = (Node *) palloc0fast(size), \
	newNodeMacroHolder->type = (tag), \
	newNodeMacroHolder \
)
#endif   /* __GNUC__ */


#define makeNode(_type_)		((_type_ *) newNode(sizeof(_type_),T_##_type_))

#+END_SRC
T_##_type_ should be paid attention, because it will be assigned
to the first member of the root node, such as SelectStmt.type, after
that, many task will be completed by the type.  

in analysis phase, the previous raw parse tree will be sematic
analysis.
#+BEGIN_SRC c
pg_analyze_and_rewrite(Node *parsetree, const char *query_string,...) 
-> parse_analyze(parsetree, query_string, paramTypes, numParams)
-> query = transformStmt(pstate, parseTree);
-> transformSelectStmt(ParseState *pstate, SelectStmt *stmt)
#+END_SRC

after parse_analyze(), we will get a query (type: Query)

in transformStmt():

#+BEGIN_SRC c
Query *
transformStmt(ParseState *pstate, Node *parseTree)
{
	Query	   *result;

	switch (nodeTag(parseTree))
	{
		case T_SelectStmt:
			{
				SelectStmt *n = (SelectStmt *) parseTree;

				if (n->valuesLists)
					result = transformValuesClause(pstate, n);
				else if (n->op == SETOP_NONE)
					result = transformSelectStmt(pstate, n);
				else
					result = transformSetOperationStmt(pstate, n);
			}
			break;

#+END_SRC

in transformSelectStmt():
#+BEGIN_SRC c
static Query *
transformSelectStmt(ParseState *pstate, SelectStmt *stmt)
{
	Query	   *qry = makeNode(Query);

#+END_SRC
from the first statement, the node type was transformed from
SelectStmt to Query.

* system catalog


** pg_opclass

| Column       | Type    | Modifiers |
|--------------+---------+-----------|
| opcmethod    | oid     | not null  |
| opcname      | name    | not null  |
| opcnamespace | oid     | not null  |
| opcowner     | oid     | not null  |
| opcfamily    | oid     | not null  |
| opcintype    | oid     | not null  |
| opcdefault   | boolean | not null  |
| opckeytype   | oid     | not null  |

** pg_am

| Column       | Type     | Modifiers |
|--------------+----------+-----------|
| amname       | name     | not null  |
| amstrategies | smallint | not null  |
| amsupport    | smallint | not null  |

** pg_amop

| Column        | Type     | Modifiers |
|---------------+----------+-----------|
| amopfamily    | oid      | not null  |
| amoplefttype  | oid      | not null  |
| amoprighttype | oid      | not null  |
| amopstrategy  | smallint | not null  |
| amopopr       | oid      | not null  |
| amopmethod    | oid      | not null  | 

