_posts/2014-07-18-postgres.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">parser</h2>
<div class="outline-text-2" id="text-4">
<p>
the parser include two phases: parser and transfromation.
</p>

<p>
the parser phase mainly creates a specified called raw
parse tree,  which is a linked list of parse nodes. there are
several kinds of nodes, as defined in parsenodes.h, such as SelectStmt,
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">typedef</span> <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">SelectStmt</span>
{
        <span style="color: #81a2be;">NodeTag</span>         <span style="color: #f0c674;">type</span>;

        <span style="color: #969896; font-style: italic;">/*</span>
<span style="color: #969896; font-style: italic;">         * These fields are used only in "leaf" SelectStmts.</span>
<span style="color: #969896; font-style: italic;">         </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">List</span>       *<span style="color: #f0c674;">distinctClause</span>; <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">NULL, list of DISTINCT ON exprs, or</span>
<span style="color: #969896; font-style: italic;">                                                                 * lcons(NIL,NIL) for all (SELECT DISTINCT) </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">IntoClause</span> *<span style="color: #f0c674;">intoClause</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">target for SELECT INTO / CREATE TABLE AS </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">List</span>       *<span style="color: #f0c674;">targetList</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">the target list (of ResTarget) </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">List</span>       *<span style="color: #f0c674;">fromClause</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">the FROM clause </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Node</span>       *<span style="color: #f0c674;">whereClause</span>;        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">WHERE qualification </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">List</span>       *<span style="color: #f0c674;">groupClause</span>;        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">GROUP BY clauses </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Node</span>       *<span style="color: #f0c674;">havingClause</span>;       <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">HAVING conditional-expression </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">List</span>       *<span style="color: #f0c674;">windowClause</span>;       <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">WINDOW window_name AS (...), ... </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">WithClause</span> *<span style="color: #f0c674;">withClause</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">WITH clause </span><span style="color: #969896; font-style: italic;">*/</span>
      ...
}
</pre>
</div>
<p>
the first member of these classes of structures all is NodeTag, every
query will create a node with some fixed members, in above
SelectStmt, which has intClause, targetList, etc,. so in gram.y, for
every kind of query, it creates a root node for special query:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #81a2be;">simple_select</span>:
                        SELECT opt_distinct target_list
                        into_clause from_clause where_clause
                        group_clause <span style="color: #81a2be;">having_clause</span> <span style="color: #f0c674;">window_clause</span>
                                {
                                        <span style="color: #81a2be;">SelectStmt</span> *<span style="color: #f0c674;">n</span> = makeNode(SelectStmt);
                                        n-&gt;distinctClause = $2;
                                        n-&gt;targetList = $3;
                                        n-&gt;intoClause = $4;
                                        n-&gt;fromClause = $5;
...
</pre>
</div>
<p>
and the definition for makeNode in nodes.h
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">extern</span> PGDLLIMPORT <span style="color: #81a2be;">Node</span> *<span style="color: #f0c674;">newNodeMacroHolder</span>;
<span style="color: #b294bb;">#define</span> <span style="color: #de935f;">newNode</span>(<span style="color: #f0c674;">size</span>, <span style="color: #f0c674;">tag</span>) \
( \
        AssertMacro((size) &gt;= <span style="color: #b5bd68;">sizeof</span>(Node)),            <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">need the tag, at least </span><span style="color: #969896; font-style: italic;">*/</span> \
        newNodeMacroHolder = (<span style="color: #81a2be;">Node</span> *) palloc0fast(size), \
        newNodeMacroHolder-&gt;type = (tag), \
        newNodeMacroHolder \
)
<span style="color: #b294bb;">#endif</span>   <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">__GNUC__ </span><span style="color: #969896; font-style: italic;">*/</span>


<span style="color: #b294bb;">#define</span> <span style="color: #de935f;">makeNode</span>(<span style="color: #f0c674;">_type_</span>)                ((<span style="color: #81a2be;">_type_</span> *) newNode(<span style="color: #b5bd68;">sizeof</span>(_type_),T_##_type_))
</pre>
</div>
<p>
T_##_type_ should be paid attention, because it will be assigned
to the first member of the root node, such as SelectStmt.type, after
that, many task will be completed by the type.  
</p>

<p>
in analysis phase, the previous raw parse tree will be sematic
analysis.
</p>
<div class="org-src-container">

<pre class="src src-c">pg_analyze_and_rewrite(Node *parsetree, <span style="color: #b5bd68;">const</span> <span style="color: #81a2be;">char</span> *<span style="color: #f0c674;">query_string</span>,...) 
-&gt; parse_analyze(parsetree, query_string, paramTypes, numParams)
-&gt; query = transformStmt(pstate, parseTree);
-&gt; transformSelectStmt(ParseState *pstate, SelectStmt *stmt)
</pre>
</div>

<p>
after parse_analyze(), we will get a query (type: Query)
</p>

<p>
in transformStmt():
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #81a2be;">Query</span> *
<span style="color: #de935f;">transformStmt</span>(<span style="color: #81a2be;">ParseState</span> *<span style="color: #f0c674;">pstate</span>, <span style="color: #81a2be;">Node</span> *<span style="color: #f0c674;">parseTree</span>)
{
        <span style="color: #81a2be;">Query</span>      *<span style="color: #f0c674;">result</span>;

        <span style="color: #b5bd68;">switch</span> (nodeTag(parseTree))
        {
                <span style="color: #b5bd68;">case</span> T_SelectStmt:
                        {
                                <span style="color: #81a2be;">SelectStmt</span> *<span style="color: #f0c674;">n</span> = (<span style="color: #81a2be;">SelectStmt</span> *) parseTree;

                                <span style="color: #b5bd68;">if</span> (n-&gt;valuesLists)
                                        result = transformValuesClause(pstate, n);
                                <span style="color: #b5bd68;">else</span> <span style="color: #b5bd68;">if</span> (n-&gt;op == SETOP_NONE)
                                        result = transformSelectStmt(pstate, n);
                                <span style="color: #b5bd68;">else</span>
                                        result = transformSetOperationStmt(pstate, n);
                        }
                        <span style="color: #b5bd68;">break</span>;
</pre>
</div>

<p>
in transformSelectStmt():
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">static</span> <span style="color: #81a2be;">Query</span> *
<span style="color: #de935f;">transformSelectStmt</span>(<span style="color: #81a2be;">ParseState</span> *<span style="color: #f0c674;">pstate</span>, <span style="color: #81a2be;">SelectStmt</span> *<span style="color: #f0c674;">stmt</span>)
{
        <span style="color: #81a2be;">Query</span>      *<span style="color: #f0c674;">qry</span> = makeNode(Query);
</pre>
</div>
<p>
from the first statement, the node type was transformed from
SelectStmt to Query.
</p>
</div>
</div>
