org/2014-07-18-postgres.org
*** pg_opfamily

| Column       | Type | Modifiers |
|--------------+------+-----------|
| opfmethod    | oid  | not null  |
| opfname      | name | not null  |
| opfnamespace | oid  | not null  |
| opfowner     | oid  | not null  |

NOTE: opcmethod, amopmethod and opfmethod are the same value as
pg_am's oid, so that the following query is right:

#+BEGIN_SRC sql
SELECT am.amname AS index_method,
       opc.opcname AS opclass_name
    FROM pg_am am, pg_opclass opc
    WHERE opc.opcmethod = am.oid
    ORDER BY index_method, opclass_name;

SELECT am.amname AS index_method,
       opf.opfname AS opfamily_name,
       amop.amopopr::regoperator AS opfamily_operator
    FROM pg_am am, pg_opfamily opf, pg_amop amop
    WHERE opf.opfmethod = am.oid AND
          amop.amopfamily = opf.oid
    ORDER BY index_method, opfamily_name, opfamily_operator;
#+END_SRC

also, amopfamily in pg_amop is the same value as pg_opfamily's oid.

* operator classes explained[fn:1]

** what is an operator class?
in PostgreSQL an index is not a hardwired thing,capable of following
just one strategy.

Asume that two values stored in a database:

#+BEGIN_SRC sql
CREATE TABLE t_sva (sva text);
 
INSERT INTO t_sva VALUES ('1118090878');
INSERT INTO t_sva VALUES ('2345010477');
#+END_SRC

1118090878 is Austrian social security number, 09 = day of month, 08 = month, 78 = year, 1118 = a sequential number,
so that 1118090878 is actually after 2345010477.

how to implement this strange sort, we need our own handcrafted
indexing strategy using PostgreSQL's operator class.

