_posts/2014-07-18-postgres.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">system catalog</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">pg_opclass</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Column</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Modifiers</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">opcmethod</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcname</td>
<td class="left">name</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcnamespace</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcowner</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcfamily</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcintype</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opcdefault</td>
<td class="left">boolean</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opckeytype</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">pg_am</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Column</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Modifiers</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">amname</td>
<td class="left">name</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amstrategies</td>
<td class="left">smallint</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amsupport</td>
<td class="left">smallint</td>
<td class="left">not null</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">pg_amop</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Column</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Modifiers</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">amopfamily</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amoplefttype</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amoprighttype</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amopstrategy</td>
<td class="left">smallint</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amopopr</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">amopmethod</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul"><li>pg_opfamily<br  /><div class="outline-text-4" id="text-5-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Column</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Modifiers</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">opfmethod</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opfname</td>
<td class="left">name</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opfnamespace</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>

<tr>
<td class="left">opfowner</td>
<td class="left">oid</td>
<td class="left">not null</td>
</tr>
</tbody>
</table>

<p>
NOTE: opcmethod, amopmethod and opfmethod are the same value as
pg_am's oid, so that the following query is right:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">SELECT</span> am.amname <span style="color: #b5bd68;">AS</span> index_method,
       opc.opcname <span style="color: #b5bd68;">AS</span> opclass_name
    <span style="color: #b5bd68;">FROM</span> pg_am am, pg_opclass opc
    <span style="color: #b5bd68;">WHERE</span> opc.opcmethod = am.oid
    <span style="color: #b5bd68;">ORDER</span> <span style="color: #b5bd68;">BY</span> index_method, opclass_name;

<span style="color: #b5bd68;">SELECT</span> am.amname <span style="color: #b5bd68;">AS</span> index_method,
       opf.opfname <span style="color: #b5bd68;">AS</span> opfamily_name,
       amop.amopopr::regoperator <span style="color: #b5bd68;">AS</span> opfamily_operator
    <span style="color: #b5bd68;">FROM</span> pg_am am, pg_opfamily opf, pg_amop amop
    <span style="color: #b5bd68;">WHERE</span> opf.opfmethod = am.oid <span style="color: #b5bd68;">AND</span>
          amop.amopfamily = opf.oid
    <span style="color: #b5bd68;">ORDER</span> <span style="color: #b5bd68;">BY</span> index_method, opfamily_name, opfamily_operator;
</pre>
</div>

<p>
also, amopfamily in pg_amop is the same value as pg_opfamily's oid.
</p>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">operator classes explained<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">what is an operator class?</h3>
<div class="outline-text-3" id="text-6-1">
<p>
in PostgreSQL an index is not a hardwired thing,capable of following
just one strategy.
</p>

<p>
Asume that two values stored in a database:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">TABLE</span> <span style="color: #de935f;">t_sva</span> (sva text);

<span style="color: #b5bd68;">INSERT</span> <span style="color: #b5bd68;">INTO</span> t_sva <span style="color: #b5bd68;">VALUES</span> (<span style="color: #8abeb7;">'1118090878'</span>);
<span style="color: #b5bd68;">INSERT</span> <span style="color: #b5bd68;">INTO</span> t_sva <span style="color: #b5bd68;">VALUES</span> (<span style="color: #8abeb7;">'2345010477'</span>);
</pre>
</div>

<p>
1118090878 is Austrian social security number, 09 = day of month, 08 = month, 78 = year, 1118 = a sequential number,
so that 1118090878 is actually after 2345010477.
</p>

<p>
how to implement this strange sort, we need our own handcrafted
indexing strategy using PostgreSQL's operator class.
</p>
</div>
</div>
