org/2014-07-18-postgres.org
** how it works
#+BEGIN_SRC sql
CREATE OR REPLACE FUNCTION normalize_si(text)
 
RETURNS text AS $$
 
        BEGIN
 
        RETURN substring($1, 9, 2) ||
 
                substring($1, 7, 2) || substring($1, 5, 2) || substring($1, 1, 4);
 
        END; $$
 
LANGUAGE 'plpgsql' IMMUTABLE;

SELECT normalize_si('1118090878');
 
normalize_si
 
--------------
 
7808091118
 
(1 row)

CREATE OR REPLACE FUNCTION si_lt(text, text)
 
        RETURNS boolean AS
 
$$
 
        BEGIN
 
                RETURN normalize_si($1) < normalize_si($2);
 
        END;
 
$$ LANGUAGE 'plpgsql' IMMUTABLE;
 
-- lower equals
 
CREATE OR REPLACE FUNCTION si_le(text, text)
 
        RETURNS boolean AS
 
$$
 
        BEGIN
 
                RETURN normalize_si($1) <= normalize_si($2);
 
        END;
 
$$ LANGUAGE 'plpgsql' IMMUTABLE;
 
-- greater equal
 
CREATE OR REPLACE FUNCTION si_ge(text, text)
 
RETURNS boolean AS
 
$$
 
BEGIN
 
RETURN normalize_si($1) >= normalize_si($2);
 
END;
 
$$ LANGUAGE 'plpgsql' IMMUTABLE;
 
-- greater
 
CREATE OR REPLACE FUNCTION si_gt(text, text)
 
RETURNS boolean AS
 
$$
 
BEGIN
 
RETURN normalize_si($1) > normalize_si($2);
 
END;
 
$$ LANGUAGE 'plpgsql' IMMUTABLE;


#+END_SRC

in PostgreSQL every operator is simply based on a stored procedure.

#+BEGIN_SRC sql
-- define operators
 
CREATE OPERATOR <# ( PROCEDURE=si_lt,
 
                        LEFTARG=text,
 
                        RIGHTARG=text);
 
CREATE OPERATOR <=# ( PROCEDURE=si_le,
 
                        LEFTARG=text,
 
                        RIGHTARG=text);
 
CREATE OPERATOR >=# ( PROCEDURE=si_ge,
 
                        LEFTARG=text,
 
                        RIGHTARG=text);
 
CREATE OPERATOR ># ( PROCEDURE=si_gt,
 
                        LEFTARG=text,
 
                        RIGHTARG=text);

tuplesort=# select * from t_sva order by sva  using >;
    sva     
------------
 2345010477
 1118090878
(2 rows)

tuplesort=# select * from t_sva order by sva  using >#;
    sva     
------------
 1118090878
 2345010477
(2 rows)
#+END_SRC

If you want to crate an operator you must tell PostgreSQL which
function to call.

** support functions
Before an index shows to handle a new strategy we have to define some
support functions.

#+BEGIN_SRC sql
CREATE OR REPLACE FUNCTION si_same(text, text)
 
        RETURNS int AS
 
$$
 
        BEGIN
 
                -- ugly code for clarity
 
                IF      normalize_si($1) < normalize_si($2)
 
                THEN
 
                        RETURN -1;
 
                ELSIF   normalize_si($1) > normalize_si($2)
 
                THEN
 
                        RETURN +1;
 
                ELSE
 
                        RETURN 0;
 
                END IF;
 
        END;
 
$$ LANGUAGE 'plpgsql' IMMUTABLE;
#+END_SRC

** create the operator classes
#+BEGIN_SRC sql
CREATE OPERATOR CLASS sva_special_ops
 
FOR TYPE text USING btree
 
AS
 
OPERATOR        1       <#  ,
 
OPERATOR        2       <=# ,
 
OPERATOR        3       =  ,
 
OPERATOR        4       >=# ,
 
OPERATOR        5       >#  ,
 
FUNCTION        1       si_same(text, text)
 
;
#+END_SRC

we have to tell index, which operators to use when and which support
functions to use.

#+BEGIN_SRC sql
CREATE INDEX idx_special ON t_sva (sva sva_special_ops);

SET enable_seqscan TO off;              -- to make sure that this work with just
 
                                                           -- two rows
 
explain SELECT * FROM t_sva WHERE sva = '0000112276';
 
                                  QUERY PLAN                                  
 
-------------------------------------------------------------------------------
 
 Index Only Scan using idx_special on t_sva  (cost=0.13..8.14 rows=1 width=32)
 
   Index Cond: (sva = '0000112276'::text)
 
(2 rows)



#+END_SRC

