_posts/2014-07-18-postgres.html

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">how it works</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">normalize_si</span>(text)

<span style="color: #b5bd68;">RETURNS</span> text <span style="color: #b5bd68;">AS</span> $$

        <span style="color: #b5bd68;">BEGIN</span>

        <span style="color: #b5bd68;">RETURN</span> <span style="color: #b294bb;">substring</span>($1, 9, 2) ||

                <span style="color: #b294bb;">substring</span>($1, 7, 2) || <span style="color: #b294bb;">substring</span>($1, 5, 2) || <span style="color: #b294bb;">substring</span>($1, 1, 4);

        <span style="color: #b5bd68;">END</span>; $$

<span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;

<span style="color: #b5bd68;">SELECT</span> normalize_si(<span style="color: #8abeb7;">'1118090878'</span>);

normalize_si

<span style="color: #969896; font-style: italic;">--------------</span>

7808091118

(1 <span style="color: #81a2be;">row</span>)

<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">si_lt</span>(text, text)

        <span style="color: #b5bd68;">RETURNS</span> <span style="color: #81a2be;">boolean</span> <span style="color: #b5bd68;">AS</span>

$$

        <span style="color: #b5bd68;">BEGIN</span>

                <span style="color: #b5bd68;">RETURN</span> normalize_si($1) &lt; normalize_si($2);

        <span style="color: #b5bd68;">END</span>;

$$ <span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;

<span style="color: #969896; font-style: italic;">-- lower equals</span>

<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">si_le</span>(text, text)

        <span style="color: #b5bd68;">RETURNS</span> <span style="color: #81a2be;">boolean</span> <span style="color: #b5bd68;">AS</span>

$$

        <span style="color: #b5bd68;">BEGIN</span>

                <span style="color: #b5bd68;">RETURN</span> normalize_si($1) &lt;= normalize_si($2);

        <span style="color: #b5bd68;">END</span>;

$$ <span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;

<span style="color: #969896; font-style: italic;">-- greater equal</span>

<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">si_ge</span>(text, text)

<span style="color: #b5bd68;">RETURNS</span> <span style="color: #81a2be;">boolean</span> <span style="color: #b5bd68;">AS</span>

$$

<span style="color: #b5bd68;">BEGIN</span>

<span style="color: #b5bd68;">RETURN</span> normalize_si($1) &gt;= normalize_si($2);

<span style="color: #b5bd68;">END</span>;

$$ <span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;

<span style="color: #969896; font-style: italic;">-- greater</span>

<span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">si_gt</span>(text, text)

<span style="color: #b5bd68;">RETURNS</span> <span style="color: #81a2be;">boolean</span> <span style="color: #b5bd68;">AS</span>

$$

<span style="color: #b5bd68;">BEGIN</span>

<span style="color: #b5bd68;">RETURN</span> normalize_si($1) &gt; normalize_si($2);

<span style="color: #b5bd68;">END</span>;

$$ <span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;
</pre>
</div>

<p>
in PostgreSQL every operator is simply based on a stored procedure.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #969896; font-style: italic;">-- define operators</span>

<span style="color: #b5bd68;">CREATE</span> OPERATOR &lt;# ( <span style="color: #b5bd68;">PROCEDURE</span>=si_lt,

                        LEFTARG=text,

                        RIGHTARG=text);

<span style="color: #b5bd68;">CREATE</span> OPERATOR &lt;=# ( <span style="color: #b5bd68;">PROCEDURE</span>=si_le,

                        LEFTARG=text,

                        RIGHTARG=text);

<span style="color: #b5bd68;">CREATE</span> OPERATOR &gt;=# ( <span style="color: #b5bd68;">PROCEDURE</span>=si_ge,

                        LEFTARG=text,

                        RIGHTARG=text);

<span style="color: #b5bd68;">CREATE</span> OPERATOR &gt;# ( <span style="color: #b5bd68;">PROCEDURE</span>=si_gt,

                        LEFTARG=text,

                        RIGHTARG=text);

tuplesort=# <span style="color: #b5bd68;">select</span> * <span style="color: #b5bd68;">from</span> t_sva <span style="color: #b5bd68;">order</span> <span style="color: #b5bd68;">by</span> sva  <span style="color: #b5bd68;">using</span> &gt;;
    sva     
<span style="color: #969896; font-style: italic;">------------</span>
 2345010477
 1118090878
(2 <span style="color: #b5bd68;">rows</span>)

tuplesort=# <span style="color: #b5bd68;">select</span> * <span style="color: #b5bd68;">from</span> t_sva <span style="color: #b5bd68;">order</span> <span style="color: #b5bd68;">by</span> sva  <span style="color: #b5bd68;">using</span> &gt;#;
    sva     
<span style="color: #969896; font-style: italic;">------------</span>
 1118090878
 2345010477
(2 <span style="color: #b5bd68;">rows</span>)
</pre>
</div>

<p>
If you want to crate an operator you must tell PostgreSQL which
function to call.
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">support functions</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Before an index shows to handle a new strategy we have to define some
support functions.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">CREATE</span> <span style="color: #b5bd68;">OR</span> REPLACE <span style="color: #b5bd68;">FUNCTION</span> <span style="color: #de935f;">si_same</span>(text, text)

        <span style="color: #b5bd68;">RETURNS</span> <span style="color: #81a2be;">int</span> <span style="color: #b5bd68;">AS</span>

$$

        <span style="color: #b5bd68;">BEGIN</span>

                <span style="color: #969896; font-style: italic;">-- ugly code for clarity</span>

                IF      normalize_si($1) &lt; normalize_si($2)

                <span style="color: #b5bd68;">THEN</span>

                        <span style="color: #b5bd68;">RETURN</span> -1;

                ELSIF   normalize_si($1) &gt; normalize_si($2)

                <span style="color: #b5bd68;">THEN</span>

                        <span style="color: #b5bd68;">RETURN</span> +1;

                <span style="color: #b5bd68;">ELSE</span>

                        <span style="color: #b5bd68;">RETURN</span> 0;

                <span style="color: #b5bd68;">END</span> IF;

        <span style="color: #b5bd68;">END</span>;

$$ <span style="color: #b5bd68;">LANGUAGE</span> <span style="color: #8abeb7;">'plpgsql'</span> IMMUTABLE;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4">create the operator classes</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">CREATE</span> OPERATOR <span style="color: #b5bd68;">CLASS</span> sva_special_ops

<span style="color: #b5bd68;">FOR</span> <span style="color: #b5bd68;">TYPE</span> text <span style="color: #b5bd68;">USING</span> btree

<span style="color: #b5bd68;">AS</span>

OPERATOR        1       &lt;#  ,

OPERATOR        2       &lt;=# ,

OPERATOR        3       =  ,

OPERATOR        4       &gt;=# ,

OPERATOR        5       &gt;#  ,

<span style="color: #b5bd68;">FUNCTION</span>        1       si_same(text, text)

;
</pre>
</div>

<p>
we have to tell index, which operators to use when and which support
functions to use.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">CREATE</span> INDEX idx_special <span style="color: #b5bd68;">ON</span> t_sva (sva sva_special_ops);

<span style="color: #b5bd68;">SET</span> enable_seqscan <span style="color: #b5bd68;">TO</span> <span style="color: #b5bd68;">off</span>;              <span style="color: #969896; font-style: italic;">-- to make sure that this work with just</span>

                                                           <span style="color: #969896; font-style: italic;">-- two rows</span>

explain <span style="color: #b5bd68;">SELECT</span> * <span style="color: #b5bd68;">FROM</span> t_sva <span style="color: #b5bd68;">WHERE</span> sva = <span style="color: #8abeb7;">'0000112276'</span>;

                                  QUERY PLAN                                  

<span style="color: #969896; font-style: italic;">-------------------------------------------------------------------------------</span>

 Index <span style="color: #b5bd68;">Only</span> Scan <span style="color: #b5bd68;">using</span> idx_special <span style="color: #b5bd68;">on</span> t_sva  (cost=0.13..8.14 <span style="color: #b5bd68;">rows</span>=1 width=32)

   Index Cond: (sva = <span style="color: #8abeb7;">'0000112276'</span>::text)

(2 <span style="color: #b5bd68;">rows</span>)
</pre>
</div>
</div>
</div>
