org/2014-07-18-postgres.org
** relative catalog info

tuplesort=# select * from pg_operator where oprnamespace=2200;

| oprname | oprnamespace | oprowner | oprkind | oprcanmerge | oprcanhash | oprleft | oprright | oprresult | oprcom | oprnegate | oprcode | oprrest | oprjoin |
|---------+--------------+----------+---------+-------------+------------+---------+----------+-----------+--------+-----------+---------+---------+---------|
| <#      |         2200 |       10 | b       | f           | f          |      25 |       25 |        16 |      0 |         0 | si_lt   | -       | -       |
| <=#     |         2200 |       10 | b       | f           | f          |      25 |       25 |        16 |      0 |         0 | si_lt   | -       | -       |
| >=#     |         2200 |       10 | b       | f           | f          |      25 |       25 |        16 |      0 |         0 | si_lt   | -       | -       |
| >#      |         2200 |       10 | b       | f           | f          |      25 |       25 |        16 |      0 |         0 | si_lt   | -       | -       |

(4 rows)

tuplesort=# select * from pg_opfamily where opfnamespace=2200;

| opfmethod | opfname         | opfnamespace | opfowner |
|-----------+-----------------+--------------+----------|
|       403 | sva_special_ops |         2200 |       10 | 
  
(1 row)

tuplesort=# select * from pg_opclass where opcnamespace=2200;

| opcmethod | opcname         | opcnamespace | opcowner | opcfamily | opcintype | opcdefault | opckeytype |
|-----------+-----------------+--------------+----------+-----------+-----------+------------+------------|
|       403 | sva_special_ops |         2200 |       10 |     41020 |        25 | f          |          0 | 
  
(1 row)

tuplesort=# select * from pg_opfamily where oid=41020;

| opfmethod | opfname         | opfnamespace | opfowner |
|-----------+-----------------+--------------+----------|
|       403 | sva_special_ops |         2200 |       10 | 
  
(1 row)
 

[fn:1] http://www.cybertec.at/operator-classes-explained/
 
** pg_class

the pg_class system table contains one row for each table defined in
your database.


