_posts/2014-07-18-postgres.html

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5">relative catalog info</h3>
<div class="outline-text-3" id="text-6-5">
<p>
tuplesort=# select * from pg_operator where oprnamespace=2200;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">oprname</th>
<th scope="col" class="right">oprnamespace</th>
<th scope="col" class="right">oprowner</th>
<th scope="col" class="left">oprkind</th>
<th scope="col" class="left">oprcanmerge</th>
<th scope="col" class="left">oprcanhash</th>
<th scope="col" class="right">oprleft</th>
<th scope="col" class="right">oprright</th>
<th scope="col" class="right">oprresult</th>
<th scope="col" class="right">oprcom</th>
<th scope="col" class="right">oprnegate</th>
<th scope="col" class="left">oprcode</th>
<th scope="col" class="left">oprrest</th>
<th scope="col" class="left">oprjoin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&lt;#</td>
<td class="right">2200</td>
<td class="right">10</td>
<td class="left">b</td>
<td class="left">f</td>
<td class="left">f</td>
<td class="right">25</td>
<td class="right">25</td>
<td class="right">16</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="left">si_lt</td>
<td class="left">-</td>
<td class="left">-</td>
</tr>

<tr>
<td class="left">&lt;=#</td>
<td class="right">2200</td>
<td class="right">10</td>
<td class="left">b</td>
<td class="left">f</td>
<td class="left">f</td>
<td class="right">25</td>
<td class="right">25</td>
<td class="right">16</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="left">si_lt</td>
<td class="left">-</td>
<td class="left">-</td>
</tr>

<tr>
<td class="left">&gt;=#</td>
<td class="right">2200</td>
<td class="right">10</td>
<td class="left">b</td>
<td class="left">f</td>
<td class="left">f</td>
<td class="right">25</td>
<td class="right">25</td>
<td class="right">16</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="left">si_lt</td>
<td class="left">-</td>
<td class="left">-</td>
</tr>

<tr>
<td class="left">&gt;#</td>
<td class="right">2200</td>
<td class="right">10</td>
<td class="left">b</td>
<td class="left">f</td>
<td class="left">f</td>
<td class="right">25</td>
<td class="right">25</td>
<td class="right">16</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="left">si_lt</td>
<td class="left">-</td>
<td class="left">-</td>
</tr>
</tbody>
</table>

<p>
(4 rows)
</p>

<p>
tuplesort=# select * from pg_opfamily where opfnamespace=2200;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">opfmethod</th>
<th scope="col" class="left">opfname</th>
<th scope="col" class="right">opfnamespace</th>
<th scope="col" class="right">opfowner</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">403</td>
<td class="left">sva_special_ops</td>
<td class="right">2200</td>
<td class="right">10</td>
</tr>
</tbody>
</table>

<p>
(1 row)
</p>

<p>
tuplesort=# select * from pg_opclass where opcnamespace=2200;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">opcmethod</th>
<th scope="col" class="left">opcname</th>
<th scope="col" class="right">opcnamespace</th>
<th scope="col" class="right">opcowner</th>
<th scope="col" class="right">opcfamily</th>
<th scope="col" class="right">opcintype</th>
<th scope="col" class="left">opcdefault</th>
<th scope="col" class="right">opckeytype</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">403</td>
<td class="left">sva_special_ops</td>
<td class="right">2200</td>
<td class="right">10</td>
<td class="right">41020</td>
<td class="right">25</td>
<td class="left">f</td>
<td class="right">0</td>
</tr>
</tbody>
</table>

<p>
(1 row)
</p>

<p>
tuplesort=# select * from pg_opfamily where oid=41020;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">opfmethod</th>
<th scope="col" class="left">opfname</th>
<th scope="col" class="right">opfnamespace</th>
<th scope="col" class="right">opfowner</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">403</td>
<td class="left">sva_special_ops</td>
<td class="right">2200</td>
<td class="right">10</td>
</tr>
</tbody>
</table>

<p>
(1 row)
</p>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6">pg_class</h3>
<div class="outline-text-3" id="text-6-6">
<p>
the pg_class system table contains one row for each table defined in
your database.
</p>
</div>
</div>
</div>
