org/2014-07-18-postgres.org
* system cache management

Every catalog cache must have a corresponding unique index on the
system table that it caches.[catcache.h] The extend explanation of it
is that every index in system table (ex., pg_class) has a
corresponding catalog cache represented by "struct catcache", every
row of the table that containing such a index has a corresponding tuple (presented by struct CatCtup) 
,which is stored in a double linked list, which is a element of
catcache' variable length array (called cc_bucket). Which double
linked list in cc_bucket is determined by hash value generated from
the row's contents and table's name. 

#+BEGIN_SRC c
typedef struct catcache
{
	int			id;				/* cache identifier --- see syscache.h */
	struct catcache *cc_next;	/* link to next catcache */
	const char *cc_relname;		/* name of relation the tuples come from */
      ...

	TupleDesc	cc_tupdesc;		/* tuple descriptor (copied from oreldesc) */
      ...
	int			cc_nbuckets;	/* # of hash buckets in this cache */
	int			cc_nkeys;		/* # of keys (1..4) */
	int			cc_key[4];		/* AttrNumber of each key */
	PGFunction	cc_hashfunc[4]; /* hash function to use for each key */
	ScanKeyData cc_skey[4];		/* precomputed key info for heap scans */

      ...
	Dllist		cc_bucket[1];	/* hash buckets --- VARIABLE LENGTH ARRAY */
} CatCache;						/* VARIABLE LENGTH STRUCT */

#+END_SRC


syscache's type is catcache, which is a low-level catalog cache. Every
system catalog table (ie, pg_class) is one item of syscache, and each
one is first time initiated by cacheinfo, of course, syscache and
cacheinfo have the same amount of items.

#+BEGIN_SRC c
struct cachedesc
{
	Oid			reloid;			/* OID of the relation being cached */
	Oid			indoid;			/* OID of index relation for this cache */
	int			reloidattr;		/* attr number of rel OID reference, or 0 */
	int			nkeys;			/* # of keys needed for cache lookup */
	int			key[4];			/* attribute numbers of key attrs */
	int			nbuckets;		/* number of hash buckets for this cache */
};
#+END_SRC

cacheinfo's type is cachedesc which defines a single syscache and contains all system catalog tables' index information, and
takes pg_class for examples,  
#+BEGIN_SRC c
	{RelationRelationId,		/* RELNAMENSP */
		ClassNameNspIndexId,
		ObjectIdAttributeNumber,
		2,
		{
			Anum_pg_class_relname,
			Anum_pg_class_relnamespace,
			0,
			0
		},
		1024
	},
#+END_SRC

ClassNameNspIndexId is defined in indexing.h:

#+BEGIN_SRC c
DECLARE_UNIQUE_INDEX(pg_class_relname_nsp_index, 2663, on pg_class using btree(relname name_ops, relnamespace oid_ops));
#define ClassNameNspIndexId  2663
#+END_SRC

pg_class_relname_nsp_index is the table pg_class' index name, we can
verify it using command:

#+BEGIN_SRC sql
tuplesort=# \d pg_class;
      Table "pg_catalog.pg_class"
     Column     |   Type    | Modifiers 
----------------+-----------+-----------
 relname        | name      | not null
 relnamespace   | oid       | not null

...

Indexes:
    "pg_class_oid_index" UNIQUE, btree (oid)
    "pg_class_relname_nsp_index" UNIQUE, btree (relname, relnamespace)

#+END_SRC

* composite variable declaration

A composite variable is one that corresponds to a complete row in a particular table. It has
fields that correspond to each column in the table. We can declare and use composite variables
in our stored procedures, either as rowtype or record.

To declare a composite variable, we use the rowtype declaration syntax
as follows:

name table%rowtype;

The result of this declaration will be a variable that itself has fields, one for each column in
the table on which it is based. Consider the following:
contact customer%rowtype;

This will create a variable called contact with fields corresponding to columns in the customer
table. To use the fields, we use the syntax variable.field. Here is an
example code fragment:

#+BEGIN_SRC sql
DECLARE
contact customer%rowtype;
address text;
BEGIN
contact.zipcode := 'XY1 6ZZ';
contact.fname := NULL;
address := contact.addressline || contact.town;
...
END;
#+END_SRC


