_posts/2014-07-18-postgres.html


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">system cache management</h2>
<div class="outline-text-2" id="text-7">
<p>
Every catalog cache must have a corresponding unique index on the
system table that it caches.[catcache.h] The extend explanation of it
is that every index in system table (ex., pg_class) has a
corresponding catalog cache represented by "struct catcache", every
row of the table that containing such a index has a corresponding tuple (presented by struct CatCtup) 
,which is stored in a double linked list, which is a element of
catcache' variable length array (called cc_bucket). Which double
linked list in cc_bucket is determined by hash value generated from
the row's contents and table's name. 
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">typedef</span> <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">catcache</span>
{
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">id</span>;                             <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">cache identifier --- see syscache.h </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">catcache</span> *<span style="color: #f0c674;">cc_next</span>;       <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">link to next catcache </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #b5bd68;">const</span> <span style="color: #81a2be;">char</span> *<span style="color: #f0c674;">cc_relname</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">name of relation the tuples come from </span><span style="color: #969896; font-style: italic;">*/</span>
      ...

        TupleDesc       cc_tupdesc;             <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">tuple descriptor (copied from oreldesc) </span><span style="color: #969896; font-style: italic;">*/</span>
      ...
        <span style="color: #81a2be;">int</span>                     cc_nbuckets;    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;"># of hash buckets in this cache </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">cc_nkeys</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;"># of keys (1..4) </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">cc_key</span>[4];              <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">AttrNumber of each key </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">PGFunction</span>      <span style="color: #f0c674;">cc_hashfunc</span>[4]; <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">hash function to use for each key </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">ScanKeyData</span> <span style="color: #f0c674;">cc_skey</span>[4];         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">precomputed key info for heap scans </span><span style="color: #969896; font-style: italic;">*/</span>

      ...
        Dllist          cc_bucket[1];   <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">hash buckets --- VARIABLE LENGTH ARRAY </span><span style="color: #969896; font-style: italic;">*/</span>
} <span style="color: #81a2be;">CatCache</span>;                                             <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">VARIABLE LENGTH STRUCT </span><span style="color: #969896; font-style: italic;">*/</span>
</pre>
</div>


<p>
syscache's type is catcache, which is a low-level catalog cache. Every
system catalog table (ie, pg_class) is one item of syscache, and each
one is first time initiated by cacheinfo, of course, syscache and
cacheinfo have the same amount of items.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">cachedesc</span>
{
        <span style="color: #81a2be;">Oid</span>                     <span style="color: #f0c674;">reloid</span>;                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">OID of the relation being cached </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Oid</span>                     <span style="color: #f0c674;">indoid</span>;                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">OID of index relation for this cache </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">reloidattr</span>;             <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">attr number of rel OID reference, or 0 </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">nkeys</span>;                  <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;"># of keys needed for cache lookup </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">key</span>[4];                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">attribute numbers of key attrs </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">nbuckets</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">number of hash buckets for this cache </span><span style="color: #969896; font-style: italic;">*/</span>
};
</pre>
</div>

<p>
cacheinfo's type is cachedesc which defines a single syscache and contains all system catalog tables' index information, and
takes pg_class for examples,  
</p>
<div class="org-src-container">

<pre class="src src-c">{RelationRelationId,            <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">RELNAMENSP </span><span style="color: #969896; font-style: italic;">*/</span>
        ClassNameNspIndexId,
        ObjectIdAttributeNumber,
        2,
        {
                Anum_pg_class_relname,
                Anum_pg_class_relnamespace,
                0,
                0
        },
        1024
},
</pre>
</div>

<p>
ClassNameNspIndexId is defined in indexing.h:
</p>

<div class="org-src-container">

<pre class="src src-c">DECLARE_UNIQUE_INDEX(pg_class_relname_nsp_index, 2663, on pg_class <span style="color: #81a2be;">using</span> <span style="color: #f0c674;">btree</span>(<span style="color: #81a2be;">relname</span> <span style="color: #f0c674;">name_ops</span>, <span style="color: #81a2be;">relnamespace</span> <span style="color: #f0c674;">oid_ops</span>));
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">ClassNameNspIndexId</span>  2663
</pre>
</div>

<p>
pg_class_relname_nsp_index is the table pg_class' index name, we can
verify it using command:
</p>

<div class="org-src-container">

<pre class="src src-sql">tuplesort=# \d pg_class;
      <span style="color: #b5bd68;">Table</span> "pg_catalog.pg_class"
     <span style="color: #b5bd68;">Column</span>     |   <span style="color: #b5bd68;">Type</span>    | Modifiers 
<span style="color: #969896; font-style: italic;">----------------+-----------+-----------</span>
 relname        | <span style="color: #b5bd68;">name</span>      | <span style="color: #b5bd68;">not</span> <span style="color: #b5bd68;">null</span>
 relnamespace   | oid       | <span style="color: #b5bd68;">not</span> <span style="color: #b5bd68;">null</span>

...

Indexes:
    "pg_class_oid_index" <span style="color: #b5bd68;">UNIQUE</span>, btree (oid)
    "pg_class_relname_nsp_index" <span style="color: #b5bd68;">UNIQUE</span>, btree (relname, relnamespace)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">composite variable declaration</h2>
<div class="outline-text-2" id="text-8">
<p>
A composite variable is one that corresponds to a complete row in a particular table. It has
fields that correspond to each column in the table. We can declare and use composite variables
in our stored procedures, either as rowtype or record.
</p>

<p>
To declare a composite variable, we use the rowtype declaration syntax
as follows:
</p>

<p>
name table%rowtype;
</p>

<p>
The result of this declaration will be a variable that itself has fields, one for each column in
the table on which it is based. Consider the following:
contact customer%rowtype;
</p>

<p>
This will create a variable called contact with fields corresponding to columns in the customer
table. To use the fields, we use the syntax variable.field. Here is an
example code fragment:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">DECLARE</span>
contact customer%rowtype;
address text;
<span style="color: #b5bd68;">BEGIN</span>
contact.zipcode := <span style="color: #8abeb7;">'XY1 6ZZ'</span>;
contact.fname := <span style="color: #b5bd68;">NULL</span>;
address := contact.addressline || contact.town;
...
<span style="color: #b5bd68;">END</span>;
</pre>
</div>
</div>
</div>
