org/2014-07-18-postgres.org
* catach cache for create a new user table

 when create a new user table:
#+BEGIN_SRC sql
create table Reserves (sid integer, bid integer,day date,rname char(25));
#+END_SRC

The user table's namespace oid is 2200, and corresponding name is
 "public", so the member of new talbe's corresponding relation(type: VarRange) has a value "public" from get\_namespace\_name():
  
 ProcessUtility() -> transformCreateStmt() -> get\_namespace\_name() 


In PostgreSQL, creating a new table will define a new class, new type
and new attributes, so that it will add new row in pg_class, pg_type
and pg_attribute finished by calling AddNewRelationType(),
AddNewRelationTuple(pg_class_desc,...) and AddNewAttributeTuples() in
heap_create_with_catalog(). At the same time, every system table has a
corresponding CatCache, so that calling get_relname_relid() and others to add a relative item in these
CatCache variable perspectively is necessary.

DefineRelation() -> heap\_create\_with\_catalog()

