_posts/2014-07-18-postgres.html


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">catach cache for create a new user table</h2>
<div class="outline-text-2" id="text-9">
<p>
when create a new user table:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #b5bd68;">create</span> <span style="color: #b5bd68;">table</span> <span style="color: #de935f;">Reserves</span> (sid <span style="color: #81a2be;">integer</span>, bid <span style="color: #81a2be;">integer</span>,<span style="color: #b5bd68;">day</span> <span style="color: #81a2be;">date</span>,rname <span style="color: #81a2be;">char</span>(25));
</pre>
</div>

<p>
The user table's namespace oid is 2200, and corresponding name is
 "public", so the member of new talbe's corresponding relation(type: VarRange) has a value "public" from get\_namespace\_name():
</p>

<p>
ProcessUtility() -&gt; transformCreateStmt() -&gt; get\_namespace\_name() 
</p>


<p>
In PostgreSQL, creating a new table will define a new class, new type
and new attributes, so that it will add new row in pg_class, pg_type
and pg_attribute finished by calling AddNewRelationType(),
AddNewRelationTuple(pg_class_desc,&#x2026;) and AddNewAttributeTuples() in
heap_create_with_catalog(). At the same time, every system table has a
corresponding CatCache, so that calling get_relname_relid() and others to add a relative item in these
CatCache variable perspectively is necessary.
</p>

<p>
DefineRelation() -&gt; heap\_create\_with\_catalog()
</p>
</div>
</div>
