org/2014-07-18-postgres.org
* data structure

VarRange, RangeTblEntry and RangeTblRef are used in parsing phase.

- VarRange
  
  RangeVar is used in From clauses and utility statements (such as
  create table ...).

#+BEGIN_SRC c
/*
 * RangeVar - range variable, used in FROM clauses
 *
 * Also used to represent table names in utility statements; there, the alias
 * field is not used, and inhOpt shows whether to apply the operation
 * recursively to child tables.  In some contexts it is also useful to carry
 * a TEMP table indication here.
 */

typedef struct RangeVar
{
	NodeTag		type;
	char	   *catalogname;	/* the catalog (database) name, or NULL */
	char	   *schemaname;		/* the schema name, or NULL */
	char	   *relname;		/* the relation/sequence name */
	InhOption	inhOpt;			/* expand rel by inheritance? recursively act
								 * on children? */
	bool		istemp;			/* is this a temp relation/sequence? */
	Alias	   *alias;			/* table alias & optional column aliases */
	int			location;		/* token location, or -1 if unknown */
} RangeVar;

#+END_SRC

- RangeTblRef 
- RangeTblEntry

- ScanKey
 A ScanKey represents the application of a comparison operator between
  a table or index column and a constant.

#+BEGIN_SRC c
typedef struct ScanKeyData
{
	int			sk_flags;		/* flags, see below */
	AttrNumber	sk_attno;		/* table or index column number */
	StrategyNumber sk_strategy; /* operator strategy number */
	Oid			sk_subtype;		/* strategy subtype */
	FmgrInfo	sk_func;		/* lookup info for function to call */
	Datum		sk_argument;	/* data to compare */
} ScanKeyData;

typedef ScanKeyData *ScanKey;

#+END_SRC

From ScanKeyData, sk_attno defines which column in a table or index,
sk_strategy indicates that we want to search the column's data >, >=,
=, < or <= sk_argument(in general, a constant), sk_func defines a
different function according to the different access
method Btree, Gist, Gin, or Hash included in pg_am, so that if
a specific AM is defined the corresponding function such as btgettuple
will be defined.

- IndexScanDescData

#+BEGIN_SRC s
typedef struct IndexScanDescData
{
	/* scan parameters */
	Relation	heapRelation;	/* heap relation descriptor, or NULL */
	Relation	indexRelation;	/* index relation descriptor */
	Snapshot	xs_snapshot;	/* snapshot to see */
	int			numberOfKeys;	/* number of scan keys */
	ScanKey		keyData;		/* array of scan key descriptors */

	/* signaling to index AM about killing index tuples */
	bool		kill_prior_tuple;		/* last-returned tuple is dead */
	bool		ignore_killed_tuples;	/* do not return killed entries */

	/* index access method's private state */
	void	   *opaque;			/* access-method-specific info */
      ...
}
#+END_SRC

heapRelation is a table, indexRelation is a index for a
specific column for the table, so that there are several different
indexRelations for one table. keyData is the original ScanKey, opaque
includes output ScanKey, and is corresponding to BTScanOpaque,
GinScanOpaque, and GistScanOpaque, HashScanOpaque.

- HeapScanDescData
If there is no index in a table, the search will use
HeapScanDescData. And HeapScanDescData includes many detailed info for
one talbe such as rs_nblocks.

#+BEGIN_SRC c
typedef struct HeapScanDescData
{
	/* scan parameters */
	Relation	rs_rd;			/* heap relation descriptor */
	Snapshot	rs_snapshot;	/* snapshot to see */
	int			rs_nkeys;		/* number of scan keys */
	ScanKey		rs_key;			/* array of scan key descriptors */
	bool		rs_bitmapscan;	/* true if this is really a bitmap scan */
	bool		rs_pageatatime; /* verify visibility page-at-a-time? */
	bool		rs_allow_strat; /* allow or disallow use of access strategy */
	bool		rs_allow_sync;	/* allow or disallow use of syncscan */

	/* state set up at initscan time */
	BlockNumber rs_nblocks;		/* number of blocks to scan */
	BlockNumber rs_startblock;	/* block # to start at */
	BufferAccessStrategy rs_strategy;	/* access strategy for reads */
	bool		rs_syncscan;	/* report location to syncscan logic? */

#+END_SRC



