_posts/2014-07-18-postgres.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">data structure</h2>
<div class="outline-text-2" id="text-10">
<p>
VarRange, RangeTblEntry and RangeTblRef are used in parsing phase.
</p>

<ul class="org-ul">
<li>VarRange

<p>
RangeVar is used in From clauses and utility statements (such as
create table &#x2026;).
</p>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #969896; font-style: italic;">/*</span>
<span style="color: #969896; font-style: italic;"> * RangeVar - range variable, used in FROM clauses</span>
<span style="color: #969896; font-style: italic;"> *</span>
<span style="color: #969896; font-style: italic;"> * Also used to represent table names in utility statements; there, the alias</span>
<span style="color: #969896; font-style: italic;"> * field is not used, and inhOpt shows whether to apply the operation</span>
<span style="color: #969896; font-style: italic;"> * recursively to child tables.  In some contexts it is also useful to carry</span>
<span style="color: #969896; font-style: italic;"> * a TEMP table indication here.</span>
<span style="color: #969896; font-style: italic;"> </span><span style="color: #969896; font-style: italic;">*/</span>

<span style="color: #b5bd68;">typedef</span> <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">RangeVar</span>
{
        <span style="color: #81a2be;">NodeTag</span>         <span style="color: #f0c674;">type</span>;
        <span style="color: #81a2be;">char</span>       *<span style="color: #f0c674;">catalogname</span>;        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">the catalog (database) name, or NULL </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">char</span>       *<span style="color: #f0c674;">schemaname</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">the schema name, or NULL </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">char</span>       *<span style="color: #f0c674;">relname</span>;            <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">the relation/sequence name </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">InhOption</span>       <span style="color: #f0c674;">inhOpt</span>;                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">expand rel by inheritance? recursively act</span>
<span style="color: #969896; font-style: italic;">                                                                 * on children? </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">istemp</span>;                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">is this a temp relation/sequence? </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Alias</span>      *<span style="color: #f0c674;">alias</span>;                      <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">table alias &amp; optional column aliases </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">location</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">token location, or -1 if unknown </span><span style="color: #969896; font-style: italic;">*/</span>
} <span style="color: #81a2be;">RangeVar</span>;
</pre>
</div>

<ul class="org-ul">
<li>RangeTblRef 
</li>
<li>RangeTblEntry
</li>

<li>ScanKey
A ScanKey represents the application of a comparison operator between
 a table or index column and a constant.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">typedef</span> <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">ScanKeyData</span>
{
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">sk_flags</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">flags, see below </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">AttrNumber</span>      <span style="color: #f0c674;">sk_attno</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">table or index column number </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">StrategyNumber</span> <span style="color: #f0c674;">sk_strategy</span>; <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">operator strategy number </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Oid</span>                     <span style="color: #f0c674;">sk_subtype</span>;             <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">strategy subtype </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">FmgrInfo</span>        <span style="color: #f0c674;">sk_func</span>;                <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">lookup info for function to call </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Datum</span>           <span style="color: #f0c674;">sk_argument</span>;    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">data to compare </span><span style="color: #969896; font-style: italic;">*/</span>
} <span style="color: #81a2be;">ScanKeyData</span>;

<span style="color: #b5bd68;">typedef</span> <span style="color: #81a2be;">ScanKeyData</span> *<span style="color: #81a2be;">ScanKey</span>;
</pre>
</div>

<p>
From ScanKeyData, sk_attno defines which column in a table or index,
sk_strategy indicates that we want to search the column's data &gt;, &gt;=,
=, &lt; or &lt;= sk_argument(in general, a constant), sk_func defines a
different function according to the different access
method Btree, Gist, Gin, or Hash included in pg_am, so that if
a specific AM is defined the corresponding function such as btgettuple
will be defined.
</p>

<ul class="org-ul">
<li>IndexScanDescData
</li>
</ul>

<div class="org-src-container">

<pre class="src src-s">typedef struct IndexScanDescData
{
	/* scan parameters */
	Relation        heapRelation;   /* heap relation descriptor, or NULL */
	Relation        indexRelation;  /* index relation descriptor */
	Snapshot        xs_snapshot;    /* snapshot to see */
	int                     numberOfKeys;   /* number of scan keys */
	ScanKey         keyData;                /* array of scan key descriptors */

	/* signaling to index AM about killing index tuples */
	bool            kill_prior_tuple;               /* last-returned tuple is dead */
	bool            ignore_killed_tuples;   /* do not return killed entries */

	/* index access method's private state */
	void       *opaque;                     /* access-method-specific info */
      ...
}
</pre>
</div>

<p>
heapRelation is a table, indexRelation is a index for a
specific column for the table, so that there are several different
indexRelations for one table. keyData is the original ScanKey, opaque
includes output ScanKey, and is corresponding to BTScanOpaque,
GinScanOpaque, and GistScanOpaque, HashScanOpaque.
</p>

<ul class="org-ul">
<li>HeapScanDescData
</li>
</ul>
<p>
If there is no index in a table, the search will use
HeapScanDescData. And HeapScanDescData includes many detailed info for
one talbe such as rs_nblocks.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b5bd68;">typedef</span> <span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">HeapScanDescData</span>
{
        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">scan parameters </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Relation</span>        <span style="color: #f0c674;">rs_rd</span>;                  <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">heap relation descriptor </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">Snapshot</span>        <span style="color: #f0c674;">rs_snapshot</span>;    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">snapshot to see </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">int</span>                     <span style="color: #f0c674;">rs_nkeys</span>;               <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">number of scan keys </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">ScanKey</span>         <span style="color: #f0c674;">rs_key</span>;                 <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">array of scan key descriptors </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">rs_bitmapscan</span>;  <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">true if this is really a bitmap scan </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">rs_pageatatime</span>; <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">verify visibility page-at-a-time? </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">rs_allow_strat</span>; <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">allow or disallow use of access strategy </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">rs_allow_sync</span>;  <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">allow or disallow use of syncscan </span><span style="color: #969896; font-style: italic;">*/</span>

        <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">state set up at initscan time </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">BlockNumber</span> <span style="color: #f0c674;">rs_nblocks</span>;         <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">number of blocks to scan </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">BlockNumber</span> <span style="color: #f0c674;">rs_startblock</span>;      <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">block # to start at </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">BufferAccessStrategy</span> <span style="color: #f0c674;">rs_strategy</span>;       <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">access strategy for reads </span><span style="color: #969896; font-style: italic;">*/</span>
        <span style="color: #81a2be;">bool</span>            <span style="color: #f0c674;">rs_syncscan</span>;    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">report location to syncscan logic? </span><span style="color: #969896; font-style: italic;">*/</span>
</pre>
</div>
</div>
</div>
