org/2014-07-18-postgres.org
* _bt_preprocess_keys() -- Preprocess scan keys

 comments: One key purpose of this routine is to discover how many scan keys
 must be satisfied to continue the scan. It also attempts to
 eliminate redundant keys and detect contradictory keys.

 what are contradictory keys? 

 the following keys are contradictory keys:

 key = 1 && key > 1 

 the above two expressions do not exist in this function, they only
 indicate that it is contradict if there exist two keys for one column of a table, one key's
 operator is =, the other >. How can we determine this case in
 PostgreSQL? Key is represented by ScanKey variables, =/> is
 corressponding to operator strategy, which included in Scankey. If
 the above cases exist, there must be two ScanKey variables, and their
 sk_attno is the same vaule. In _bt_preprocess_keys(), The
 different ScanKeys with the same sk_attno will be first stored in a
 array xfrom[] in order of operator strategy definition BTLessStrategyNumber, BTLessEqualStrategyNumber,
 BTEqualStrategyNumber, BTGreaterEqualStrategyNumber,
 BTGreaterStrategyNumber, and then check whether they are contradict,
 or redundant. 
#+BEGIN_SRC c
	inkeys = scan->keyData;
      ...
	cur = &inkeys[0];
      ...
      memset(xform, 0, sizeof(xform));

	for (i = 0;; cur++, i++)
      {
        if (... cur->sk_attno != attno){ //assert the same column
             ...
	     /* Re-initialize for new attno */
	     attno = cur->sk_attno;
	     memset(xform, 0, sizeof(xform));
        }
        j = cur->sk_strategy - 1;
   	  if (xform[j] == NULL)
	  {
		/* nope, so remember this scankey */
		xform[j] = cur;
	 }

      }
#+END_SRC		

#+BEGIN_SRC c
#define BTLessStrategyNumber			1
#define BTLessEqualStrategyNumber		2
#define BTEqualStrategyNumber			3
#define BTGreaterEqualStrategyNumber	4
#define BTGreaterStrategyNumber			5

#define BTMaxStrategyNumber				5
#+END_SRC

* some useful calling path
- btgettuple()->_bt_first()
- btbeginscan()->RelationGetIndexScan()->index_rescan()->FunctionCall2()->btgettuple()

- DefineRelation(CreateStmt *stmt, char relkind)->
  heap_create_with_catalog(relname,...)->get_relname_relid(const char
  *relname, Oid relnamespace)->
GetSysCacheOid(RELNAMENSP, PointerGetDatum(relname), ObjectIdGetDatum(relnamespace),
						  0, 0)
						  ->SearchSysCache(cacheId,
						  key1, key2, key3,
						  key4) ->
						  SearchCatCache(SysCache[cacheId],
						  key1, key2, key3,
						  key4) ->
						  systable_beginscan(relation,...) ->

* simple path for one simple query
The whole course is mainy finished in exec_simple_query(const char
*query_string), 

1. produces parse tree list through:
#+BEGIN_SRC c
   parsetree_list = pg_parse_query(query_string);
#+END_SRC,

2. travels the whole list:
#+BEGIN_SRC c
foreach(parsetree_item, parsetree_list){
   Node   *parsetree = (Node *) lfirst(parsetree_item);
}
#+END_SRC

3. for every item, experiences analyze, rewrite and getting plan tree
#+BEGIN_SRC c
querytree_list = pg_analyze_and_rewrite(parsetree, query_string,
												NULL, 0);
plantree_list = pg_plan_queries(querytree_list, 0, NULL);
#+END_SRC

4.execute plan tree
#+BEGIN_SRC c
portal = CreatePortal("", true, true);
PortalDefineQuery(portal,
				  NULL,
				  query_string,
				  commandTag,
				  plantree_list,
				  NULL);

PortalStart(portal, NULL, InvalidSnapshot);

(void) PortalRun(portal,
				 FETCH_ALL,
				 isTopLevel,
				 receiver,
				 receiver,
				 completionTag);
#+END_SRC







