_posts/2014-07-18-postgres.html



<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">_bt_preprocess_keys() &#x2013; Preprocess scan keys</h2>
<div class="outline-text-2" id="text-11">
<p>
comments: One key purpose of this routine is to discover how many scan keys
must be satisfied to continue the scan. It also attempts to
eliminate redundant keys and detect contradictory keys.
</p>

<p>
what are contradictory keys? 
</p>

<p>
the following keys are contradictory keys:
</p>

<p>
key = 1 &amp;&amp; key &gt; 1 
</p>

<p>
the above two expressions do not exist in this function, they only
indicate that it is contradict if there exist two keys for one column of a table, one key's
operator is =, the other &gt;. How can we determine this case in
PostgreSQL? Key is represented by ScanKey variables, =/&gt; is
corressponding to operator strategy, which included in Scankey. If
the above cases exist, there must be two ScanKey variables, and their
sk_attno is the same vaule. In _bt_preprocess_keys(), The
different ScanKeys with the same sk_attno will be first stored in a
array xfrom[] in order of operator strategy definition BTLessStrategyNumber, BTLessEqualStrategyNumber,
BTEqualStrategyNumber, BTGreaterEqualStrategyNumber,
BTGreaterStrategyNumber, and then check whether they are contradict,
or redundant. 
</p>
<div class="org-src-container">

<pre class="src src-c">  inkeys = scan-&gt;keyData;
...
  cur = &amp;inkeys[0];
...
memset(xform, 0, <span style="color: #b5bd68;">sizeof</span>(xform));

  <span style="color: #b5bd68;">for</span> (i = 0;; cur++, i++)
{
  <span style="color: #b5bd68;">if</span> (... cur-&gt;sk_attno != attno){ <span style="color: #969896; font-style: italic;">//</span><span style="color: #969896; font-style: italic;">assert the same column</span>
       ...
       <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">Re-initialize for new attno </span><span style="color: #969896; font-style: italic;">*/</span>
       attno = cur-&gt;sk_attno;
       memset(xform, 0, <span style="color: #b5bd68;">sizeof</span>(xform));
  }
  j = cur-&gt;sk_strategy - 1;
    <span style="color: #b5bd68;">if</span> (xform[j] == <span style="color: #81a2be;">NULL</span>)
    {
          <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">nope, so remember this scankey </span><span style="color: #969896; font-style: italic;">*/</span>
          xform[j] = cur;
   }

}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTLessStrategyNumber</span>                    1
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTLessEqualStrategyNumber</span>               2
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTEqualStrategyNumber</span>                   3
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTGreaterEqualStrategyNumber</span>    4
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTGreaterStrategyNumber</span>                 5

<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">BTMaxStrategyNumber</span>                             5
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">some useful calling path</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>btgettuple()-&gt;_bt_first()
</li>
<li>btbeginscan()-&gt;RelationGetIndexScan()-&gt;index_rescan()-&gt;FunctionCall2()-&gt;btgettuple()
</li>

<li>DefineRelation(CreateStmt *stmt, char relkind)-&gt;
heap_create_with_catalog(relname,&#x2026;)-&gt;get_relname_relid(const char
*relname, Oid relnamespace)-&gt;
</li>
</ul>
<p>
GetSysCacheOid(RELNAMENSP, PointerGetDatum(relname), ObjectIdGetDatum(relnamespace),
                                                  0, 0)
                                                  -&gt;SearchSysCache(cacheId,
                                                  key1, key2, key3,
                                                  key4) -&gt;
                                                  SearchCatCache(SysCache[cacheId],
                                                  key1, key2, key3,
                                                  key4) -&gt;
                                                  systable_beginscan(relation,&#x2026;) -&gt;
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">simple path for one simple query</h2>
<div class="outline-text-2" id="text-13">
<p>
The whole course is mainy finished in exec_simple_query(const char
*query_string), 
</p>

<ol class="org-ol">
<li>produces parse tree list through:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-c">parsetree_list = pg_parse_query(query_string);
</pre>
</div>

<ol class="org-ol">
<li>for every item, experiences analyze, rewrite and getting plan tree
</li>
</ol>
<div class="org-src-container">

<pre class="src src-c">querytree_list = pg_analyze_and_rewrite(parsetree, query_string,
                                                                                                <span style="color: #81a2be;">NULL</span>, 0);
plantree_list = pg_plan_queries(querytree_list, 0, <span style="color: #81a2be;">NULL</span>);
</pre>
</div>

<p>
4.execute plan tree
</p>
<div class="org-src-container">

<pre class="src src-c">portal = CreatePortal(<span style="color: #8abeb7;">""</span>, <span style="color: #81a2be;">true</span>, <span style="color: #81a2be;">true</span>);
PortalDefineQuery(portal,
                                  <span style="color: #81a2be;">NULL</span>,
                                  query_string,
                                  commandTag,
                                  plantree_list,
                                  <span style="color: #81a2be;">NULL</span>);

PortalStart(portal, <span style="color: #81a2be;">NULL</span>, InvalidSnapshot);

(<span style="color: #81a2be;">void</span>) PortalRun(portal,
                                 FETCH_ALL,
                                 isTopLevel,
                                 receiver,
                                 receiver,
                                 completionTag);
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://www.cybertec.at/operator-classes-explained/">http://www.cybertec.at/operator-classes-explained/</a>
</p></div>


</div>
</div>
